data/raw/host/benchmark_host_ibm-power9_20260706_231006.txt
=== PRÉ-EXECUÇÃO: desativando swap ===
sudo: a terminal is required to read the password; either use the -S option to read from standard input or configure an askpass helper
sudo: a password is required
AVISO: swapoff falhou ou swap já estava desativado.
Estado do swap após swapoff:
NAME      TYPE      SIZE USED PRIO
/dev/sda2 partition   6G   0B   -2
=== BENCHMARK HOST: ibm-power9 — 20260706_231006 ===
Ambiente: Host físico — IBM Power9 ppc64le
CPUs alocadas (Slurm): 16
RAM alocada  (Slurm): 64 GB
GPUs visíveis (CUDA_VISIBLE_DEVICES): 0,1
GPUs detectadas: 1

========================================================================

=== INFO DO SISTEMA ===
Linux ibm-power9 4.18.0-553.139.1.el8_10.ppc64le #1 SMP Tue Jun 30 22:27:17 UTC 2026 ppc64le ppc64le ppc64le GNU/Linux
CPUs visíveis (nproc): 160
CPUs em uso (Slurm)  : 16
              total        used        free      shared  buff/cache   available
Mem:          567Gi        70Gi       491Gi        22Mi       6.1Gi       494Gi
Swap:         6.0Gi          0B       6.0Gi
Swap: 1 dispositivo(s)

========================================================================

=== INFO DO FILESYSTEM ===
Filesystem     Type  Size  Used Avail Use% Mounted on
/dev/sdb1      ext4  3.5T  3.0T  298G  92% /
/dev/sdb1 on / type ext4 (rw,relatime,stripe=2)

========================================================================

=== CGROUP DO PROCESSO ===
12:rdma:/
11:freezer:/slurm/uid_1000/job_54/step_batch
10:memory:/system.slice/slurmd.service
9:hugetlb:/
8:perf_event:/
7:devices:/system.slice/slurmd.service
6:net_cls,net_prio:/
5:cpuset:/
4:cpu,cpuacct:/system.slice/slurmd.service
3:blkio:/system.slice/slurmd.service
2:pids:/system.slice/slurmd.service
1:name=systemd:/system.slice/slurmd.service
0::/

========================================================================

=== CPU ===
stress-ng: info:  [50486] setting to a 60 second run per stressor
stress-ng: info:  [50486] dispatching hogs: 16 cpu
stress-ng: info:  [50486] stressor       bogo ops real time  usr time  sys time   bogo ops/s     bogo ops/s
stress-ng: info:  [50486]                           (secs)    (secs)    (secs)   (real time) (usr+sys time)
stress-ng: info:  [50486] cpu              322423     60.02    960.23      0.01      5372.36         335.77
stress-ng: info:  [50486] successful run completed in 60.04s (1 min, 0.04 secs)

========================================================================

=== MEMÓRIA ===
stress-ng: info:  [50579] setting to a 60 second run per stressor
stress-ng: info:  [50579] dispatching hogs: 8 vm
stress-ng: info:  [50579] stressor       bogo ops real time  usr time  sys time   bogo ops/s     bogo ops/s
stress-ng: info:  [50579]                           (secs)    (secs)    (secs)   (real time) (usr+sys time)
stress-ng: info:  [50579] vm             30778015     60.01    453.24     12.71    512862.66       66053.38
stress-ng: info:  [50579] successful run completed in 60.02s (1 min, 0.02 secs)

========================================================================

=== CACHE ===
stress-ng: info:  [50670] setting to a 60 second run per stressor
stress-ng: info:  [50670] dispatching hogs: 16 cache
stress-ng: info:  [50670] stressor       bogo ops real time  usr time  sys time   bogo ops/s     bogo ops/s
stress-ng: info:  [50670]                           (secs)    (secs)    (secs)   (real time) (usr+sys time)
stress-ng: info:  [50670] cache            297834     60.00    950.27      2.65      4963.69         312.55
stress-ng: info:  [50670] successful run completed in 60.11s (1 min, 0.11 secs)

========================================================================

=== STREAM — LARGURA DE BANDA DE MEMÓRIA ===
-------------------------------------------------------------
STREAM version $Revision: 5.10 $
-------------------------------------------------------------
This system uses 8 bytes per array element.
-------------------------------------------------------------
Array size = 80000000 (elements), Offset = 0 (elements)
Memory per array = 610.4 MiB (= 0.6 GiB).
Total memory required = 1831.1 MiB (= 1.8 GiB).
Each kernel will be executed 20 times.
 The *best* time for each kernel (excluding the first iteration)
 will be used to compute the reported bandwidth.
-------------------------------------------------------------
Number of Threads requested = 16
Number of Threads counted = 16
-------------------------------------------------------------
Your clock granularity/precision appears to be 1 microseconds.
Each test below will take on the order of 10413 microseconds.
   (= 10413 clock ticks)
Increase the size of the arrays if this shows that
you are not getting at least 20 clock ticks per test.
-------------------------------------------------------------
WARNING -- The above is only a rough guideline.
For best results, please be sure you know the
precision of your system timer.
-------------------------------------------------------------
Function    Best Rate MB/s  Avg time     Min time     Max time
Copy:          123172.3     0.011944     0.010392     0.012738
Scale:         120369.2     0.011857     0.010634     0.021172
Add:           127958.4     0.015616     0.015005     0.016536
Triad:         124465.8     0.016486     0.015426     0.018241
-------------------------------------------------------------
Solution Validates: avg error less than 1.000000e-13 on all three arrays
-------------------------------------------------------------

========================================================================


=== [DISCO_HOST] PRÉ-ALOCAÇÃO DO ARQUIVO DE TESTE (80G) ===
precreate: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
fio-3.19
Starting 1 process
precreate: Laying out IO file (1 file / 81920MiB)

precreate: (groupid=0, jobs=1): err= 0: pid=50790: Mon Jul  6 23:16:17 2026
  write: IOPS=442, BW=442MiB/s (464MB/s)(80.0GiB/185228msec); 0 zone resets
    slat (usec): min=35, max=113980, avg=57.77, stdev=450.46
    clat (msec): min=2, max=664, avg=72.29, stdev=35.30
     lat (msec): min=2, max=664, avg=72.35, stdev=35.32
    clat percentiles (msec):
     |  1.00th=[   57],  5.00th=[   62], 10.00th=[   62], 20.00th=[   63],
     | 30.00th=[   63], 40.00th=[   63], 50.00th=[   63], 60.00th=[   63],
     | 70.00th=[   64], 80.00th=[   69], 90.00th=[   96], 95.00th=[  120],
     | 99.00th=[  205], 99.50th=[  368], 99.90th=[  502], 99.95th=[  600],
     | 99.99th=[  642]
   bw (  KiB/s): min=42836, max=569115, per=100.00%, avg=453078.29, stdev=119262.90, samples=368
   iops        : min=   41, max=  555, avg=441.64, stdev=116.36, samples=368
  lat (msec)   : 4=0.02%, 10=0.11%, 20=0.20%, 50=0.55%, 100=90.11%
  lat (msec)   : 250=8.18%, 500=0.73%, 750=0.10%
  cpu          : usr=1.13%, sys=1.67%, ctx=80775, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,81920,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=442MiB/s (464MB/s), 442MiB/s-442MiB/s (464MB/s-464MB/s), io=80.0GiB (85.9GB), run=185228-185228msec

Disk stats (read/write):
  sdb: ios=0/82027, merge=0/1588, ticks=0/5883424, in_queue=5883424, util=95.81%

=== [DISCO_HOST] LEITURA SEQUENCIAL ===
seq-read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
...
fio-3.19
Starting 4 processes

seq-read: (groupid=0, jobs=4): err= 0: pid=51051: Mon Jul  6 23:17:17 2026
  read: IOPS=513, BW=513MiB/s (538MB/s)(30.1GiB/60130msec)
    slat (usec): min=10, max=4505.4k, avg=6447.78, stdev=60009.43
    clat (msec): min=61, max=14761, avg=242.03, stdev=571.20
     lat (msec): min=61, max=15131, avg=248.48, stdev=585.39
    clat percentiles (msec):
     |  1.00th=[   96],  5.00th=[  122], 10.00th=[  124], 20.00th=[  125],
     | 30.00th=[  125], 40.00th=[  132], 50.00th=[  140], 60.00th=[  218],
     | 70.00th=[  247], 80.00th=[  249], 90.00th=[  284], 95.00th=[  481],
     | 99.00th=[ 1770], 99.50th=[ 3272], 99.90th=[11073], 99.95th=[11476],
     | 99.99th=[11879]
   bw (  KiB/s): min= 8156, max=1064794, per=100.00%, avg=589641.66, stdev=73997.49, samples=422
   iops        : min=    4, max= 1037, avg=573.52, stdev=72.33, samples=422
  lat (msec)   : 100=1.08%, 250=83.96%, 500=12.21%, 750=1.48%, 1000=0.08%
  lat (msec)   : 2000=0.38%, >=2000=0.81%
  cpu          : usr=0.03%, sys=0.22%, ctx=23682, majf=0, minf=2128
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=99.6%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=30858,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=513MiB/s (538MB/s), 513MiB/s-513MiB/s (538MB/s-538MB/s), io=30.1GiB (32.4GB), run=60130-60130msec

Disk stats (read/write):
  sdb: ios=30739/51, merge=0/83, ticks=3688557/5558, in_queue=3694115, util=98.61%

=== [DISCO_HOST] ESCRITA SEQUENCIAL ===
seq-write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
...
fio-3.19
Starting 4 processes

seq-write: (groupid=0, jobs=4): err= 0: pid=51139: Mon Jul  6 23:18:18 2026
  write: IOPS=456, BW=457MiB/s (479MB/s)(26.8GiB/60165msec); 0 zone resets
    slat (usec): min=24, max=474441, avg=8664.92, stdev=19245.04
    clat (msec): min=2, max=1020, avg=271.52, stdev=107.22
     lat (msec): min=15, max=1094, avg=280.18, stdev=109.50
    clat percentiles (msec):
     |  1.00th=[  118],  5.00th=[  153], 10.00th=[  169], 20.00th=[  197],
     | 30.00th=[  215], 40.00th=[  234], 50.00th=[  251], 60.00th=[  275],
     | 70.00th=[  296], 80.00th=[  326], 90.00th=[  376], 95.00th=[  456],
     | 99.00th=[  726], 99.50th=[  793], 99.90th=[  936], 99.95th=[  969],
     | 99.99th=[ 1011]
   bw (  KiB/s): min=93831, max=760858, per=100.00%, avg=467771.50, stdev=32153.51, samples=476
   iops        : min=   88, max=  742, avg=454.63, stdev=31.52, samples=476
  lat (msec)   : 4=0.01%, 10=0.02%, 20=0.02%, 50=0.09%, 100=0.42%
  lat (msec)   : 250=48.67%, 500=46.86%, 750=3.09%, 1000=0.79%, 2000=0.03%
  cpu          : usr=0.44%, sys=1.02%, ctx=10387, majf=1, minf=81
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=99.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,27466,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=457MiB/s (479MB/s), 457MiB/s-457MiB/s (479MB/s-479MB/s), io=26.8GiB (28.8GB), run=60165-60165msec

Disk stats (read/write):
  sdb: ios=0/27490, merge=0/18, ticks=0/3560172, in_queue=3560173, util=92.21%

=== [DISCO_HOST] IOPS ALEATÓRIO (4K randrw 70/30) ===
rand-rw: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.19
Starting 4 processes

rand-rw: (groupid=0, jobs=4): err= 0: pid=51212: Mon Jul  6 23:19:19 2026
  read: IOPS=22.2k, BW=86.7MiB/s (90.9MB/s)(5200MiB/60002msec)
    slat (usec): min=4, max=201635, avg=99.90, stdev=423.28
    clat (usec): min=317, max=222612, avg=7924.27, stdev=4044.82
     lat (usec): min=324, max=222618, avg=8024.96, stdev=4079.37
    clat percentiles (usec):
     |  1.00th=[  1778],  5.00th=[  3294], 10.00th=[  4080], 20.00th=[  5604],
     | 30.00th=[  6718], 40.00th=[  7373], 50.00th=[  7832], 60.00th=[  8455],
     | 70.00th=[  8848], 80.00th=[  9634], 90.00th=[ 10814], 95.00th=[ 12387],
     | 99.00th=[ 19268], 99.50th=[ 23462], 99.90th=[ 33424], 99.95th=[ 40633],
     | 99.99th=[217056]
   bw (  KiB/s): min=51920, max=169888, per=100.00%, avg=88813.39, stdev=3623.70, samples=476
   iops        : min=12980, max=42472, avg=22201.95, stdev=905.97, samples=476
  write: IOPS=9543, BW=37.3MiB/s (39.1MB/s)(2237MiB/60002msec); 0 zone resets
    slat (usec): min=5, max=201646, avg=168.03, stdev=477.05
    clat (usec): min=143, max=220962, avg=7989.39, stdev=4059.28
     lat (usec): min=150, max=221623, avg=8158.23, stdev=4110.00
    clat percentiles (usec):
     |  1.00th=[  1729],  5.00th=[  3130], 10.00th=[  3982], 20.00th=[  5669],
     | 30.00th=[  6718], 40.00th=[  7570], 50.00th=[  7898], 60.00th=[  8586],
     | 70.00th=[  8979], 80.00th=[  9765], 90.00th=[ 10945], 95.00th=[ 12387],
     | 99.00th=[ 19530], 99.50th=[ 23725], 99.90th=[ 34341], 99.95th=[ 41157],
     | 99.99th=[208667]
   bw (  KiB/s): min=22176, max=73208, per=100.00%, avg=38200.12, stdev=1564.86, samples=476
   iops        : min= 5544, max=18302, avg=9548.71, stdev=391.26, samples=476
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.08%, 1000=0.23%
  lat (msec)   : 2=1.51%, 4=7.72%, 10=73.64%, 20=15.91%, 50=0.88%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=2.97%, sys=11.72%, ctx=681070, majf=0, minf=435
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=1331117,572636,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=86.7MiB/s (90.9MB/s), 86.7MiB/s-86.7MiB/s (90.9MB/s-90.9MB/s), io=5200MiB (5452MB), run=60002-60002msec
  WRITE: bw=37.3MiB/s (39.1MB/s), 37.3MiB/s-37.3MiB/s (39.1MB/s-39.1MB/s), io=2237MiB (2346MB), run=60002-60002msec

Disk stats (read/write):
  sdb: ios=1328364/571452, merge=0/14, ticks=2069474/853903, in_queue=2923377, util=69.13%

=== [DISCO_HOST] LATÊNCIA (4K randread síncrono) ===
lat-read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.19
Starting 1 process

lat-read: (groupid=0, jobs=1): err= 0: pid=51285: Mon Jul  6 23:20:19 2026
  read: IOPS=3210, BW=12.5MiB/s (13.1MB/s)(752MiB/60001msec)
    slat (nsec): min=6500, max=120134, avg=6985.24, stdev=442.17
    clat (usec): min=100, max=3069, avg=301.47, stdev=332.57
     lat (usec): min=107, max=3076, avg=309.11, stdev=332.62
    clat percentiles (usec):
     |  1.00th=[  121],  5.00th=[  122], 10.00th=[  123], 20.00th=[  124],
     | 30.00th=[  137], 40.00th=[  139], 50.00th=[  141], 60.00th=[  169],
     | 70.00th=[  174], 80.00th=[  178], 90.00th=[  979], 95.00th=[ 1004],
     | 99.00th=[ 1020], 99.50th=[ 1020], 99.90th=[ 1778], 99.95th=[ 1827],
     | 99.99th=[ 2212]
   bw (  KiB/s): min= 3751, max=26693, per=100.00%, avg=12882.49, stdev=10428.25, samples=119
   iops        : min=  937, max= 6673, avg=3220.18, stdev=2607.24, samples=119
  lat (usec)   : 250=81.39%, 500=0.01%, 750=0.01%, 1000=12.63%
  lat (msec)   : 2=5.96%, 4=0.01%
  cpu          : usr=1.26%, sys=3.51%, ctx=192611, majf=0, minf=19
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=192607,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=12.5MiB/s (13.1MB/s), 12.5MiB/s-12.5MiB/s (13.1MB/s-13.1MB/s), io=752MiB (789MB), run=60001-60001msec

Disk stats (read/write):
  sdb: ios=192517/59, merge=0/18, ticks=58257/78, in_queue=58335, util=96.72%

=== [DISCO_HOST] REMOVENDO ARQUIVO DE TESTE ===
Arquivo removido: /tmp/fio_testfile_host

========================================================================

=== GPU ===

=== GPU — INFO (nvidia-smi) ===
Mon Jul  6 23:20:20 2026       
+-----------------------------------------------------------------------------------------+
| NVIDIA-SMI 550.54.15              Driver Version: 550.54.15      CUDA Version: 12.4     |
|-----------------------------------------+------------------------+----------------------+
| GPU  Name                 Persistence-M | Bus-Id          Disp.A | Volatile Uncorr. ECC |
| Fan  Temp   Perf          Pwr:Usage/Cap |           Memory-Usage | GPU-Util  Compute M. |
|                                         |                        |               MIG M. |
|=========================================+========================+======================|
|   0  Tesla V100-SXM2-16GB           On  |   00000004:04:00.0 Off |                    0 |
| N/A   25C    P0             37W /  150W |       0MiB /  16384MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+
|   1  Tesla V100-SXM2-16GB           On  |   00000004:05:00.0 Off |                    0 |
| N/A   30C    P0             38W /  150W |       0MiB /  16384MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+
|   2  Tesla V100-SXM2-16GB           On  |   00000035:03:00.0 Off |                    0 |
| N/A   25C    P0             39W /  150W |       0MiB /  16384MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+
|   3  Tesla V100-SXM2-16GB           On  |   00000035:04:00.0 Off |                    0 |
| N/A   28C    P0             39W /  150W |       0MiB /  16384MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+
                                                                                         
+-----------------------------------------------------------------------------------------+
| Processes:                                                                              |
|  GPU   GI   CI        PID   Type   Process name                              GPU Memory |
|        ID   ID                                                               Usage      |
|=========================================================================================|
|  No running processes found                                                             |
+-----------------------------------------------------------------------------------------+

=== GPU — TOPOLOGIA / NVLink ===
	GPU0	GPU1	GPU2	GPU3	CPU Affinity	NUMA Affinity	GPU NUMA ID
GPU0	 X 	NV3	SYS	SYS	0-79	0		255
GPU1	NV3	 X 	SYS	SYS	0-79	0		254
GPU2	SYS	SYS	 X 	NV3	80-159	8		253
GPU3	SYS	SYS	NV3	 X 	80-159	8		252

Legend:

  X    = Self
  SYS  = Connection traversing PCIe as well as the SMP interconnect between NUMA nodes (e.g., QPI/UPI)
  NODE = Connection traversing PCIe as well as the interconnect between PCIe Host Bridges within a NUMA node
  PHB  = Connection traversing PCIe as well as a PCIe Host Bridge (typically the CPU)
  PXB  = Connection traversing multiple PCIe bridges (without traversing the PCIe Host Bridge)
  PIX  = Connection traversing at most a single PCIe bridge
  NV#  = Connection traversing a bonded set of # NVLinks

=== GPU — BANDWIDTH TEST (H2D / D2H / D2D) ===
--- GPU 0 ---
[CUDA Bandwidth Test] - Starting...
Running on...

 Device 0: Tesla V100-SXM2-16GB
 Range Mode

 Host to Device Bandwidth, 1 Device(s)
 PINNED Memory Transfers
   Transfer Size (Bytes)	Bandwidth(GB/s)
   1048576			32.2
   34603008			37.9
   68157440			38.4
   101711872			39.2
   135266304			39.7
   168820736			40.1
   202375168			40.4
   235929600			40.5

 Device to Host Bandwidth, 1 Device(s)
 PINNED Memory Transfers
   Transfer Size (Bytes)	Bandwidth(GB/s)
   1048576			16.7
   34603008			34.2
   68157440			36.5
   101711872			36.6
   135266304			35.6
   168820736			35.4
   202375168			35.3
   235929600			35.4

 Device to Device Bandwidth, 1 Device(s)
 PINNED Memory Transfers
   Transfer Size (Bytes)	Bandwidth(GB/s)
   1048576			324.4
   34603008			749.5
   68157440			768.3
   101711872			774.2
   135266304			779.2
   168820736			781.9
   202375168			782.8
   235929600			785.3

Result = PASS

NOTE: The CUDA Samples are not meant for performance measurements. Results may vary when GPU Boost is enabled.

--- GPU 1 ---
[CUDA Bandwidth Test] - Starting...
Running on...

 Device 1: Tesla V100-SXM2-16GB
 Range Mode

 Host to Device Bandwidth, 1 Device(s)
 PINNED Memory Transfers
   Transfer Size (Bytes)	Bandwidth(GB/s)
   1048576			34.0
   34603008			38.3
   68157440			38.7
   101711872			39.6
   135266304			40.0
   168820736			40.4
   202375168			40.6
   235929600			40.7

 Device to Host Bandwidth, 1 Device(s)
 PINNED Memory Transfers
   Transfer Size (Bytes)	Bandwidth(GB/s)
   1048576			16.1
   34603008			34.3
   68157440			36.2
   101711872			35.8
   135266304			35.1
   168820736			34.8
   202375168			34.9
   235929600			34.9

 Device to Device Bandwidth, 1 Device(s)
 PINNED Memory Transfers
   Transfer Size (Bytes)	Bandwidth(GB/s)
   1048576			323.7
   34603008			749.7
   68157440			768.5
   101711872			775.2
   135266304			779.5
   168820736			781.7
   202375168			783.5
   235929600			784.2

Result = PASS

NOTE: The CUDA Samples are not meant for performance measurements. Results may vary when GPU Boost is enabled.

=== GPU — MATRIXMUL — Throughput de Computação (GFlop/s) ===
-- Execução 1 --
[Matrix Multiply Using CUDA] - Starting...
GPU Device 0: "Volta" with compute capability 7.0

MatrixA(320,320), MatrixB(640,320)
Computing result using CUDA Kernel...
done
Performance= 2766.77 GFlop/s, Time= 0.047 msec, Size= 131072000 Ops, WorkgroupSize= 1024 threads/block
Checking computed result for correctness: Result = PASS

NOTE: The CUDA Samples are not meant for performance measurements. Results may vary when GPU Boost is enabled.
-- Execução 2 --
[Matrix Multiply Using CUDA] - Starting...
GPU Device 0: "Volta" with compute capability 7.0

MatrixA(320,320), MatrixB(640,320)
Computing result using CUDA Kernel...
done
Performance= 2787.46 GFlop/s, Time= 0.047 msec, Size= 131072000 Ops, WorkgroupSize= 1024 threads/block
Checking computed result for correctness: Result = PASS

NOTE: The CUDA Samples are not meant for performance measurements. Results may vary when GPU Boost is enabled.
-- Execução 3 --
[Matrix Multiply Using CUDA] - Starting...
GPU Device 0: "Volta" with compute capability 7.0

MatrixA(320,320), MatrixB(640,320)
Computing result using CUDA Kernel...
done
Performance= 2789.08 GFlop/s, Time= 0.047 msec, Size= 131072000 Ops, WorkgroupSize= 1024 threads/block
Checking computed result for correctness: Result = PASS

NOTE: The CUDA Samples are not meant for performance measurements. Results may vary when GPU Boost is enabled.
-- Execução 4 --
[Matrix Multiply Using CUDA] - Starting...
GPU Device 0: "Volta" with compute capability 7.0

MatrixA(320,320), MatrixB(640,320)
Computing result using CUDA Kernel...
done
Performance= 2786.85 GFlop/s, Time= 0.047 msec, Size= 131072000 Ops, WorkgroupSize= 1024 threads/block
Checking computed result for correctness: Result = PASS

NOTE: The CUDA Samples are not meant for performance measurements. Results may vary when GPU Boost is enabled.
-- Execução 5 --
[Matrix Multiply Using CUDA] - Starting...
GPU Device 0: "Volta" with compute capability 7.0

MatrixA(320,320), MatrixB(640,320)
Computing result using CUDA Kernel...
done
Performance= 2787.66 GFlop/s, Time= 0.047 msec, Size= 131072000 Ops, WorkgroupSize= 1024 threads/block
Checking computed result for correctness: Result = PASS

NOTE: The CUDA Samples are not meant for performance measurements. Results may vary when GPU Boost is enabled.

=== GPU — NCCL ALL_REDUCE (NVLink inter-GPU) ===
--- -b 8 -e 256M -f 2 -g 2 ---
# nccl-tests version 2.18.3 nccl-headers=22707 nccl-library=22105
# Collective test starting: all_reduce_perf
# nThread 1 nGpus 2 minBytes 8 maxBytes 268435456 step: 2(factor) warmup iters: 1 iters: 20 agg iters: 1 validation: 1 graph: 0 unalign: 0
#
# Using devices
#  Rank  0 Group  0 Pid  51551 on ibm-power9 device  0 [0004:04:00] Tesla V100-SXM2-16GB
#  Rank  1 Group  0 Pid  51551 on ibm-power9 device  1 [0004:05:00] Tesla V100-SXM2-16GB
#
#                                                              out-of-place                       in-place          
#       size         count      type   redop    root     time   algbw   busbw  #wrong     time   algbw   busbw  #wrong 
#        (B)    (elements)                               (us)  (GB/s)  (GB/s)             (us)  (GB/s)  (GB/s)         
           8             2     float     sum      -1    20.83    0.00    0.00       0    20.79    0.00    0.00       0
          16             4     float     sum      -1    20.46    0.00    0.00       0    20.60    0.00    0.00       0
          32             8     float     sum      -1    20.47    0.00    0.00       0    20.47    0.00    0.00       0
          64            16     float     sum      -1    20.51    0.00    0.00       0    20.55    0.00    0.00       0
         128            32     float     sum      -1    20.51    0.01    0.01       0    20.56    0.01    0.01       0
         256            64     float     sum      -1    20.43    0.01    0.01       0    20.80    0.01    0.01       0
         512           128     float     sum      -1    20.51    0.02    0.02       0    20.42    0.03    0.03       0
        1024           256     float     sum      -1    20.56    0.05    0.05       0    20.56    0.05    0.05       0
        2048           512     float     sum      -1    20.56    0.10    0.10       0    20.65    0.10    0.10       0
        4096          1024     float     sum      -1    20.72    0.20    0.20       0    20.64    0.20    0.20       0
        8192          2048     float     sum      -1    20.88    0.39    0.39       0    20.71    0.40    0.40       0
       16384          4096     float     sum      -1    21.21    0.77    0.77       0    21.49    0.76    0.76       0
       32768          8192     float     sum      -1    21.80    1.50    1.50       0    21.55    1.52    1.52       0
       65536         16384     float     sum      -1    22.81    2.87    2.87       0    22.78    2.88    2.88       0
      131072         32768     float     sum      -1    22.97    5.71    5.71       0    22.96    5.71    5.71       0
      262144         65536     float     sum      -1    23.37   11.22   11.22       0    23.24   11.28   11.28       0
      524288        131072     float     sum      -1    38.38   13.66   13.66       0    38.30   13.69   13.69       0
     1048576        262144     float     sum      -1    45.94   22.82   22.82       0    45.44   23.08   23.08       0
     2097152        524288     float     sum      -1    61.63   34.03   34.03       0    59.44   35.28   35.28       0
     4194304       1048576     float     sum      -1    98.07   42.77   42.77       0    97.22   43.14   43.14       0
     8388608       2097152     float     sum      -1   166.04   50.52   50.52       0   165.96   50.55   50.55       0
    16777216       4194304     float     sum      -1   295.63   56.75   56.75       0   295.32   56.81   56.81       0
    33554432       8388608     float     sum      -1   559.90   59.93   59.93       0   560.09   59.91   59.91       0
    67108864      16777216     float     sum      -1  1059.36   63.35   63.35       0  1044.99   64.22   64.22       0
   134217728      33554432     float     sum      -1  2060.35   65.14   65.14       0  2063.81   65.03   65.03       0
   268435456      67108864     float     sum      -1  4061.67   66.09   66.09       0  4063.23   66.06   66.06       0
# Out of bounds values : 0 OK
# Avg bus bandwidth    : 19.2046 
#
# Collective test concluded: all_reduce_perf
#


=== GPU — NCCL ALL_GATHER (NVLink inter-GPU) ===
--- -b 8 -e 256M -f 2 -g 2 ---
# nccl-tests version 2.18.3 nccl-headers=22707 nccl-library=22105
# Collective test starting: all_gather_perf
# nThread 1 nGpus 2 minBytes 8 maxBytes 268435456 step: 2(factor) warmup iters: 1 iters: 20 agg iters: 1 validation: 1 graph: 0 unalign: 0
#
# Using devices
#  Rank  0 Group  0 Pid  51579 on ibm-power9 device  0 [0004:04:00] Tesla V100-SXM2-16GB
#  Rank  1 Group  0 Pid  51579 on ibm-power9 device  1 [0004:05:00] Tesla V100-SXM2-16GB
#
#                                                              out-of-place                       in-place          
#       size         count      type   redop    root     time   algbw   busbw  #wrong     time   algbw   busbw  #wrong 
#        (B)    (elements)                               (us)  (GB/s)  (GB/s)             (us)  (GB/s)  (GB/s)         
           0             0     float    none      -1     0.77    0.00    0.00       0     0.76    0.00    0.00       0
           0             0     float    none      -1     0.76    0.00    0.00       0     0.74    0.00    0.00       0
          32             4     float    none      -1    20.69    0.00    0.00       0    20.53    0.00    0.00       0
          64             8     float    none      -1    20.35    0.00    0.00       0    20.33    0.00    0.00       0
         128            16     float    none      -1    20.70    0.01    0.00       0    20.35    0.01    0.00       0
         256            32     float    none      -1    20.36    0.01    0.01       0    20.48    0.01    0.01       0
         512            64     float    none      -1    20.51    0.02    0.01       0    20.36    0.03    0.01       0
        1024           128     float    none      -1    20.37    0.05    0.03       0    20.40    0.05    0.03       0
        2048           256     float    none      -1    20.40    0.10    0.05       0    20.44    0.10    0.05       0
        4096           512     float    none      -1    20.41    0.20    0.10       0    20.40    0.20    0.10       0
        8192          1024     float    none      -1    20.58    0.40    0.20       0    20.44    0.40    0.20       0
       16384          2048     float    none      -1    20.77    0.79    0.39       0    20.72    0.79    0.40       0
       32768          4096     float    none      -1    21.27    1.54    0.77       0    21.06    1.56    0.78       0
       65536          8192     float    none      -1    22.43    2.92    1.46       0    22.15    2.96    1.48       0
      131072         16384     float    none      -1    22.31    5.87    2.94       0    22.47    5.83    2.92       0
      262144         32768     float    none      -1    22.70   11.55    5.77       0    22.76   11.52    5.76       0
      524288         65536     float    none      -1    24.96   21.01   10.50       0    23.23   22.57   11.29       0
     1048576        131072     float    none      -1    30.17   34.75   17.38       0    30.34   34.56   17.28       0
     2097152        262144     float    none      -1    38.60   54.33   27.17       0    38.12   55.02   27.51       0
     4194304        524288     float    none      -1    56.10   74.76   37.38       0    54.02   77.65   38.82       0
     8388608       1048576     float    none      -1    87.59   95.77   47.88       0    86.33   97.17   48.58       0
    16777216       2097152     float    none      -1   149.06  112.55   56.28       0   147.62  113.65   56.83       0
    33554432       4194304     float    none      -1   272.18  123.28   61.64       0   270.27  124.15   62.08       0
    67108864       8388608     float    none      -1   519.96  129.06   64.53       0   516.33  129.97   64.99       0
   134217728      16777216     float    none      -1  1021.43  131.40   65.70       0  1012.25  132.59   66.30       0
   268435456      33554432     float    none      -1  2021.13  132.81   66.41       0  1997.53  134.38   67.19       0
# Out of bounds values : 0 OK
# Avg bus bandwidth    : 18.0614 
#
# Collective test concluded: all_gather_perf
#


=== GPU — NCCL SENDRECV (latência ponto a ponto GPU0↔GPU1) ===
--- -b 8 -e 4M -f 2 -g 2 ---
# nccl-tests version 2.18.3 nccl-headers=22707 nccl-library=22105
# Collective test starting: sendrecv_perf
# nThread 1 nGpus 2 minBytes 8 maxBytes 4194304 step: 2(factor) warmup iters: 1 iters: 20 agg iters: 1 validation: 1 graph: 0 unalign: 0
#
# Using devices
#  Rank  0 Group  0 Pid  51616 on ibm-power9 device  0 [0004:04:00] Tesla V100-SXM2-16GB
#  Rank  1 Group  0 Pid  51616 on ibm-power9 device  1 [0004:05:00] Tesla V100-SXM2-16GB
#
#                                                              out-of-place                       in-place          
#       size         count      type   redop    root     time   algbw   busbw  #wrong     time   algbw   busbw  #wrong 
#        (B)    (elements)                               (us)  (GB/s)  (GB/s)             (us)  (GB/s)  (GB/s)         
           8             2     float     sum      -1    20.88    0.00    0.00       0    20.62    0.00    0.00    N/A
          16             4     float     sum      -1    20.56    0.00    0.00       0    20.59    0.00    0.00    N/A
          32             8     float     sum      -1    20.55    0.00    0.00       0    20.49    0.00    0.00    N/A
          64            16     float     sum      -1    20.70    0.00    0.00       0    20.56    0.00    0.00    N/A
         128            32     float     sum      -1    20.57    0.01    0.01       0    20.56    0.01    0.01    N/A
         256            64     float     sum      -1    20.62    0.01    0.01       0    20.63    0.01    0.01    N/A
         512           128     float     sum      -1    20.61    0.02    0.02       0    20.70    0.02    0.02    N/A
        1024           256     float     sum      -1    20.56    0.05    0.05       0    20.69    0.05    0.05    N/A
        2048           512     float     sum      -1    20.57    0.10    0.10       0    20.58    0.10    0.10    N/A
        4096          1024     float     sum      -1    20.45    0.20    0.20       0    20.53    0.20    0.20    N/A
        8192          2048     float     sum      -1    20.64    0.40    0.40       0    20.54    0.40    0.40    N/A
       16384          4096     float     sum      -1    20.99    0.78    0.78       0    21.09    0.78    0.78    N/A
       32768          8192     float     sum      -1    20.99    1.56    1.56       0    20.97    1.56    1.56    N/A
       65536         16384     float     sum      -1    20.85    3.14    3.14       0    20.75    3.16    3.16    N/A
      131072         32768     float     sum      -1    21.89    5.99    5.99       0    21.73    6.03    6.03    N/A
      262144         65536     float     sum      -1    23.14   11.33   11.33       0    23.28   11.26   11.26    N/A
      524288        131072     float     sum      -1    23.75   22.07   22.07       0    23.57   22.25   22.25    N/A
     1048576        262144     float     sum      -1    27.99   37.47   37.47       0    27.49   38.14   38.14    N/A
     2097152        524288     float     sum      -1    43.61   48.09   48.09       0    43.13   48.63   48.63    N/A
     4194304       1048576     float     sum      -1    75.72   55.39   55.39       0    73.86   56.79   56.79    N/A
# Out of bounds values : 0 OK
# Avg bus bandwidth    : 9.4002 
#
# Collective test concluded: sendrecv_perf
#


=== GPU — ESTADO PÓS-BENCHMARK ===
0, Tesla V100-SXM2-16GB, 27, 65.07 W, 4 MiB, 16384 MiB, 0 %
1, Tesla V100-SXM2-16GB, 33, 64.05 W, 5 MiB, 16384 MiB, 0 %
2, Tesla V100-SXM2-16GB, 25, 39.73 W, 0 MiB, 16384 MiB, 0 %
3, Tesla V100-SXM2-16GB, 28, 39.24 W, 0 MiB, 16384 MiB, 0 %

========================================================================


=== PÓS-EXECUÇÃO: reativando swap ===
sudo: a terminal is required to read the password; either use the -S option to read from standard input or configure an askpass helper
sudo: a password is required
AVISO: swapon falhou.
Estado do swap após swapon:
NAME      TYPE      SIZE USED PRIO
/dev/sda2 partition   6G   0B   -2

=== FIM ===
Resultados salvos em: /home/multiarq/experimentos/host/benchmark_host_ibm-power9_20260706_231006.txt